# დაწერეთ პროგრამა, რომელიც ასრულებს მაღაზიის სალაროს სამუშაოს. წარმოიდგინეთ რომ გაქვთ რაიმე მაღაზია(ტექნიკის, წიგნების...ა.შ).
# დავალების პირობები:
# 1. გაქვთ პროდუქტების სია (მაგალითად: პური, რძე, კარაქი, შაქარი) და მათი ფასები.  
# 2. პროგრამა ეკითხება მომხმარებელს რომელი და რა რაოდენობის პროდუქტის შეძენა სურს, იქამდე სანამ მომხმარებელი არ შეიყვანს 0-ს.
#  3. ბოლოს უნდა გამოითვალოს სრული თანხა და დაბეჭდოს:  
# რას ყიდულობდა მომხმარებელი (პროდუქტების სია რაოდენობით),
# ჯამური ღირებულება.

# ალგორითმი უნდა მუშაობდეს დაახლოებით ასე:

# output:
# შეიყვანეთ პროდუქტის სახელი და რაოდენობა.
# დასასრულებლად ჩაწერეთ '0'.
# პროდუქტი: პური
# რამდენი გნებავთ?: 2

# პროდუქტი: შაქარი
# რამდენი გნებავთ?: 3

# პროდუქტი: კარტოფილი
# ასეთი პროდუქტი არ გვაქვს. სცადეთ სხვა რამე.

# პროდუქტი: რძე
# რამდენი გნებავთ?: 1

# პროდუქტი: 0

# თქვენი კალათა:
# პური: 2 ცალი - 3.0 ლარი
# შაქარი: 3 ცალი - 7.5 ლარი
# რძე: 1 ცალი - 2.0 ლარი

# სულ გადასახდელი თანხა: 12.5 ლარი

products = {
    "თაფლი": 22,
    "პური": 1.89,
    "ძროხის ხორცი": 28,
    "კოკა-კოლა": 1.99,
    "ენერგეტიკული": 2.90,
    "რძე": 2.50,
    "ყავა": 25.75,
    "ჩაი": 12.30,
    "შაქარი": 3.50,
    "მარილი": 2.20,
    "სულგუნი": 23.50,
    "კარაქი": 7.80,
    "canbebe": 35.00,
    "ABC": 9.99,
    "Domestos": 12.49,
    "დოშირაკი": 3.05,
    "protein bar": 5.50
}

cart = {}
total = 0

print("======================================")
print("     🛒 კეთილი იყოს თქვენი მობრძანება 🛒")
print("======================================")
print("პროდუქტის შეძენისთვის აკრიფეთ პროდუქტის სახელი სახელი")
print("დასრულებისთვის დაწერეთ: 0")
print("======================================\n")

while True:
    item = input("👉 პროდუქტი: ")

    if item == "0":
        print("\n🛑 შეძენა დასრულებულია!")
        break

    if item not in products:
        print("❌ ასეთი პროდუქტი არ გვაქვს! სცადეთ თავიდან.\n")
        continue

    amount = int(input("✏️  რაოდენობა: "))

    if item in cart:
        cart[item] += amount
    else:
        cart[item] = amount

    total += amount * products[item]

    print(f"✔️ {item} დამატებულია კალათაში! ({amount} ცალი)\n")

print("\n======================================")
print("             🧺 თქვენი კალათა")
print("======================================\n")

for key_product, value_amount in cart.items():
    price = value_amount * products[key_product]
    print(f"• {key_product:<15} x {value_amount:<3} = {price:.2f} ₾")

print("\n======================================")
print(f"💵 გადასახდელი თანხა: {total:.2f} ₾")
print("გმადლობთ რომ გვესტუმრეთ! ❤️")
print("======================================")
