# პროგრამა 2:
# while ციკლის და input ფუნქციის გამოყენებით დაწერეთ პროგრამა, რომელიც შეასრულებს შემდეგ ფუნქციონალს:
# მომხმარებელს გამოუტანეთ რაიმე შეკითხვა, არ აქვს მნიშვნელობა რა იქნება ეს შეკითხვა, შეგიძლიათ კითხოთ რამდენი არის 2 + 2 ან რომელიმე ქვეყნის დედაქალაქი.

# მომხმარებელმა შემდეგ უნდა ჩაწეროს ამ შეკითხვაზე პასუხი. თუ სწორად არ უპასუხა მაშინ თავიდან უნდა შეაყვანინოთ პასუხი იქამდე სანამ სწორად არ უპასუხებს, სწორად პასუხის შემთხვევაში კი უნდა გადავიდეს შემდეგ შეკითხვაზე.

# სულ უნდა იყოს 5 შეკითხვა, როდესაც ბოლო შეკითხვას უპასუხებს მომხარებელი, დაუწერეთ მას თავისი ქულა
# (შექმენით ცვლადი რომელიც იწყება 10 ქულით და თითო არასწორ პასუხზე აკლდება 1 ქულა)

# მითითება:
# გაითვალისწინეთ, რომ input-ში გადაცემული მნიშვნელობა ყოველთვის არის string, ამიტომ უნდა გამოიყენოთ int ფუნქცია რათა გადააქციოთ მთელ რიცხვად. მაგალითად: int(input("text..."))

points = 10
questions = [
    "რას აკეთებს print() ფუნქცია Python-ში?",
    "რომელი მონაცემის ტიპია 'Hello'?",
    "რომელი სიმბოლო გამოიყენება გამრავლებისთვის Python-ში?",
    "როგორ გამოაცხადებ ცვლადს სახელად age, რომელსაც მნიშვნელობა აქვს 15?",
    "რამდენი დღეა ერთ წელიწადში? (ნორმალურში და არა ნაკიანში)"
]

answers = ["ტექსტს ბეჭდავს ეკრანზე", "სტრინგი", "*", "age = 15", "365"]

for i in range(len(questions)):
    user = input(questions[i])

    while user != answers[i]:
        print("try again!")
        points -= 1
        user = input(questions[i])
        if points == 0: 
            print("You lost the game!")
            exit()


print("All Done 🥳", points)
